# Terraform
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_storage_bucket.my_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_storage_bucket" "my_bucket" {
      [32m+[0m [0m[1m[0mbucket_policy_only[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mlabels[0m[0m                      = {
          [32m+[0m [0m"test" = "demotest"
        }
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "US-EAST1"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "sma-testbucket-48693"
      [32m+[0m [0m[1m[0mproject[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m               = "STANDARD"
      [32m+[0m [0m[1m[0muniform_bucket_level_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0murl[0m[0m                         = (known after apply)
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan_output.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.binary"

```